cmsis-svd/cmsis-svd/data/SiliconLabs/EFM32PG22/EFM32PG22C200F256IM32.svd
        <register>
          <name>PPUSATD0</name>
          <description>Set peripheral bits to 1 to mark as secure access only.</description>
          <addressOffset>0x060</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EMU</name>
              <description>EMU Secure Access</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMU</name>
              <description>CMU Secure Access</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HFXO0</name>
              <description>HFXO0 Secure Access</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HFRCO0</name>
              <description>HFRCO0 Secure Access</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FSRCO</name>
              <description>FSRCO Secure Access</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPLL0</name>
              <description>DPLL0 Secure Access</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LFXO</name>
              <description>LFXO Secure Access</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LFRCO</name>
              <description>LFRCO Secure Access</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ULFRCO</name>
              <description>ULFRCO Secure Access</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSC</name>
              <description>MSC Secure Access</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICACHE0</name>
              <description>ICACHE0 Secure Access</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRS</name>
              <description>PRS Secure Access</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO</name>
              <description>GPIO Secure Access</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDMA</name>
              <description>LDMA Secure Access</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDMAXBAR</name>
              <description>LDMAXBAR Secure Access</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0</name>
              <description>TIMER0 Secure Access</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1</name>
              <description>TIMER1 Secure Access</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2</name>
              <description>TIMER2 Secure Access</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER3</name>
              <description>TIMER3 Secure Access</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER4</name>
              <description>TIMER4 Secure Access</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USART0</name>
              <description>USART0 Secure Access</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USART1</name>
              <description>USART1 Secure Access</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BURTC</name>
              <description>BURTC Secure Access</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1</name>
              <description>I2C1 Secure Access</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHIPTESTCTRL</name>
              <description>CHIPTESTCTRL Secure Access</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCFGCFGNS</name>
              <description>SYSCFGCFGNS Secure Access</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCFG</name>
              <description>SYSCFG Secure Access</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BURAM</name>
              <description>BURAM Secure Access</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPCRC</name>
              <description>GPCRC Secure Access</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCI</name>
              <description>DCI Secure Access</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPUSATD1</name>
          <description>Set peripheral bits to 1 to mark as secure access only.</description>
          <addressOffset>0x064</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>DCDC</name>
              <description>DCDC Secure Access</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDM</name>
              <description>PDM Secure Access</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMU</name>
              <description>SMU Secure Access</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMUCFGNS</name>
              <description>SMUCFGNS Secure Access</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCC</name>
              <description>RTCC Secure Access</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LETIMER0</name>
              <description>LETIMER0 Secure Access</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IADC0</name>
              <description>IADC0 Secure Access</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C0</name>
              <description>I2C0 Secure Access</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDOG0</name>
              <description>WDOG0 Secure Access</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AMUXCP0</name>
              <description>AMUXCP0 Secure Access</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EUART0</name>
              <description>EUART0 Secure Access</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRYPTOACC</name>
              <description>CRYPTOACC Secure Access</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPUFS</name>
          <description>Read to get fault status of SMU.</description>
          <addressOffset>0x140</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>PPUFSPERIPHID</name>
              <description>Peripheral ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BMPUPATD0</name>
          <description>Set master bits to 1 to mark as a privileged master.</description>
          <addressOffset>0x150</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000001F</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>CRYPTOACC</name>
              <description>CRYPTOACC DMA privileged mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDMA</name>
              <description>MCU LDMA privileged mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BMPUSATD0</name>
          <description>Set master bits to 1 to mark as a secure master.</description>
          <addressOffset>0x170</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000001F</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>CRYPTOACC</name>
              <description>CRYPTOACC DMA secure mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDMA</name>
              <description>MCU LDMA secure mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BMPUFS</name>
          <description>Read to get  status about the master that triggered a fault.</description>
          <addressOffset>0x250</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>BMPUFSMASTERID</name>
              <description>Master ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BMPUFSADDR</name>
          <description>Read to get the access address that triggered a fault.</description>
          <addressOffset>0x254</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BMPUFSADDR</name>
              <description>Fault Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESAURTYPES0</name>
          <description>Write to specify if a region is secure or non-secure.</description>
          <addressOffset>0x260</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001000</resetMask>
          <fields>
            <field>
              <name>ESAUR3NS</name>
              <description>Region 3 Non-Secure Type</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESAURTYPES1</name>
          <description>Write to specify if a region is secure or non-secure.</description>
          <addressOffset>0x264</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001000</resetMask>
          <fields>
            <field>
              <name>ESAUR11NS</name>
              <description>Region 11 Non-Secure Type</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESAUMRB01</name>
          <description>Specify the boundary between regions 0 and 1.</description>
          <addressOffset>0x270</addressOffset>
          <access>read-write</access>
          <resetValue>0x02000000</resetValue>
          <resetMask>0x0FFFF000</resetMask>
          <fields>
            <field>
              <name>ESAUMRB01</name>
              <description>Moveable Region Boundary 0-1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESAUMRB12</name>
          <description>Specify the boundary between regions 1 and 2.</description>
          <addressOffset>0x274</addressOffset>
          <access>read-write</access>
          <resetValue>0x04000000</resetValue>
          <resetMask>0x0FFFF000</resetMask>
          <fields>
            <field>
              <name>ESAUMRB12</name>
              <description>Moveable Region Boundary 1-2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESAUMRB45</name>
          <description>Specify the boundary between regions 4 and 5.</description>
          <addressOffset>0x280</addressOffset>
          <access>read-write</access>
          <resetValue>0x02000000</resetValue>
          <resetMask>0x0FFFF000</resetMask>
          <fields>
            <field>
              <name>ESAUMRB45</name>
              <description>Moveable Region Boundary 4-5</description>
              <bitOffset>12</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ESAUMRB56</name>
          <description>Specify the boundary between regions 5 and 6.</description>
          <addressOffset>0x284</addressOffset>
          <access>read-write</access>
          <resetValue>0x04000000</resetValue>
          <resetMask>0x0FFFF000</resetMask>
          <fields>
            <field>
              <name>ESAUMRB56</name>
              <description>Moveable Region Boundary 5-6</description>
              <bitOffset>12</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
